[
  {
    "name": "المسجد الحرام - Masjid al-Haram",
    "city": "Makkah",
    "image": "masjid_al_haram.png",
    "shortHistory": "The holiest mosque in Islam, surrounds the Kaaba.",
    "fullHistory": "المسجد الحرام هو أعظم مسجد في الإسلام ويقع في قلب مكة المكرمة.\n\nMasjid al-Haram is the holiest mosque in Islam, surrounding the Kaaba, the qibla for Muslims worldwide. Millions visit annually for Hajj and Umrah. The mosque has immense historical and spiritual significance, being the first house of worship built for mankind.\n\nLocation: Center of Makkah.",
    "latitude": 21.4237,
    "longitude": 39.8254
  },
  {
    "name": "المسجد النبوي - Masjid an-Nabawi",
    "city": "Madinah",
    "image": "masjid_an_nabawi.png",
    "shortHistory": "The Prophet’s Mosque, second holiest in Islam.",
    "fullHistory": "المسجد النبوي هو ثاني أقدس مسجد في الإسلام بعد المسجد الحرام.\n\nMasjid an-Nabawi was built by Prophet Muhammad ﷺ in Madinah. It houses the Prophet’s tomb and is a major pilgrimage site. The mosque is renowned for its tranquility and spiritual atmosphere.\n\nLocation: Center of Madinah.",
    "latitude": 24.4672,
    "longitude": 39.6111
  },
  {
    "name": "غار حراء - Cave of Hira",
    "city": "Makkah",
    "imageUrl": "https://images.unsplash.com/photo-1591604466107-ec97de577aff",
    "shortHistory": "The cave where Prophet Muhammad ﷺ received the first revelation of the Quran.",
    "fullHistory": "غار حراء هو المكان المبارك الذي نزل فيه الوحي على النبي محمد ﷺ لأول مرة.\n\nCave of Hira is the blessed cave on Jabal al-Nour where Angel Jibreel (Gabriel) came to Prophet Muhammad ﷺ with the first verses of the Quran: \"Read! In the Name of your Lord who has created...\" (Al-Alaq 96:1)\n\nThe Prophet ﷺ used to retreat here for meditation (tahannuth) before receiving prophethood. This cave holds immense significance as the birthplace of the Quranic revelation that changed human history.\n\nLocation: Jabal al-Nour (Mountain of Light), approximately 4 km from Masjid al-Haram.",
    "latitude": 21.4570,
    "longitude": 39.8597
  },
  {
    "name": "غار ثور - Cave of Thawr",
    "city": "Makkah",
    "imageUrl": "https://images.unsplash.com/photo-1564769625905-50e93615e769",
    "shortHistory": "The cave where Prophet Muhammad ﷺ and Abu Bakr hid during the Hijrah to Madinah.",
    "fullHistory": "غار ثور هو الكهف الذي اختبأ فيه النبي ﷺ وأبو بكر الصديق رضي الله عنه أثناء الهجرة.\n\nCave of Thawr is where Prophet Muhammad ﷺ and Abu Bakr al-Siddiq (RA) sought refuge during their migration (Hijrah) to Madinah in 622 CE.\n\nAllah mentions this event in the Quran: \"If you do not help him, Allah has already helped him when those who disbelieved expelled him, the second of two when they were in the cave...\" (At-Tawbah 9:40)\n\nThe famous miracle of the spider's web and dove's nest occurred here, protecting them from the Quraysh pursuers.\n\nLocation: Jabal Thawr, approximately 4 km south of Makkah.",
    "latitude": 21.3891,
    "longitude": 39.8328
  },
  {
    "name": "مقبرة المعلاة - Jannat al-Mu'alla",
    "city": "Makkah",
    "imageUrl": "https://images.unsplash.com/photo-1542816417-0983c9c9ad53",
    "shortHistory": "The historic cemetery of Makkah where many companions are buried.",
    "fullHistory": "مقبرة المعلاة (جنة المعلى) هي المقبرة الرئيسية لأهل مكة منذ عصر الإسلام.\n\nJannat al-Mu'alla (also known as Al-Hajun) is the main cemetery of Makkah where many blessed personalities are buried, including:\n\n• Khadijah bint Khuwaylid (RA) - The first wife of Prophet Muhammad ﷺ\n• Abu Talib - The uncle of the Prophet ﷺ\n• Abdul Muttalib - The grandfather of the Prophet ﷺ\n• Abdullah - The father of the Prophet ﷺ\n\nThe cemetery holds great historical significance as it contains the graves of many early Muslims and members of the Prophet's family.\n\nLocation: Near Masjid al-Jinn, northern Makkah.",
    "latitude": 21.4358,
    "longitude": 39.8306
  },
  {
    "name": "مسجد قباء - Masjid Quba",
    "city": "Madinah",
    "imageUrl": "https://images.unsplash.com/photo-1591604129939-f1efa4d9f7fa",
    "shortHistory": "The first mosque built in Islam by Prophet Muhammad ﷺ.",
    "fullHistory": "مسجد قباء هو أول مسجد بني في الإسلام.\n\nMasjid Quba holds the distinction of being the first mosque ever built in Islam. Prophet Muhammad ﷺ laid its foundation immediately upon arriving in Madinah during the Hijrah.\n\nThe Prophet ﷺ said: \"Whoever purifies himself at home and then comes to Masjid Quba and prays therein, will have a reward like that of an Umrah.\" (Sunan Ibn Majah)\n\nThe Quran mentions this mosque: \"A mosque founded on righteousness from the first day is more worthy for you to stand in...\" (At-Tawbah 9:108)\n\nThe Prophet ﷺ used to visit this mosque every Saturday, either riding or on foot, and pray two rak'ahs.\n\nLocation: Southwestern outskirts of Madinah, about 5 km from Masjid an-Nabawi.",
    "latitude": 24.4395,
    "longitude": 39.6174
  },
  {
    "name": "جبل أحد - Mount Uhud",
    "city": "Madinah",
    "imageUrl": "https://images.unsplash.com/photo-1580418827493-f2b22c0a76cb",
    "shortHistory": "The mountain where the Battle of Uhud took place in 625 CE.",
    "fullHistory": "جبل أحد هو الموقع الذي وقعت عنده غزوة أحد.\n\nMount Uhud is a mountain that witnessed the famous Battle of Uhud in 625 CE (3 AH), where 70 companions were martyred including Hamza ibn Abdul-Muttalib (RA), the beloved uncle of the Prophet ﷺ.\n\nThe Prophet ﷺ said: \"Uhud is a mountain that loves us and we love it.\" (Sahih al-Bukhari)\n\nThe battle was a test of faith where Muslims learned valuable lessons about obedience to the Prophet ﷺ. The martyrs are buried at the foot of the mountain in the Martyrs' Cemetery (Shuhada Uhud).\n\nProphet Muhammad ﷺ would visit the graves of the martyrs and pray: \"Peace be upon you for what you patiently endured. And excellent is the final home.\" (Ar-Ra'd 13:24)\n\nLocation: North of Madinah, approximately 5 km from Masjid an-Nabawi.",
    "latitude": 24.4847,
    "longitude": 39.6206
  },
  {
    "name": "البقيع - Jannat al-Baqi",
    "city": "Madinah",
    "imageUrl": "https://images.unsplash.com/photo-1542816417-0983c9c9ad53",
    "shortHistory": "The main cemetery in Madinah where thousands of companions are buried.",
    "fullHistory": "البقيع هي المقبرة الرئيسية في المدينة المنورة.\n\nJannat al-Baqi (The Garden of Baqi) is the main cemetery of Madinah where an estimated 10,000 companions of the Prophet ﷺ are buried, including:\n\n• Uthman ibn Affan (RA) - Third Caliph\n• Abbas ibn Abdul-Muttalib (RA) - Uncle of the Prophet ﷺ\n• Fatimah bint Muhammad (RA) - Daughter of the Prophet ﷺ (according to some narrations)\n• Imam Hassan ibn Ali (RA) - Grandson of the Prophet ﷺ\n• Many wives of the Prophet ﷺ (Ummahat al-Mu'minin)\n\nThe Prophet ﷺ would visit this cemetery at night and say: \"Peace be upon you, abode of believing people. What you were promised has come to you...\" (Sahih Muslim)\n\nLocation: Adjacent to Masjid an-Nabawi, southeastern side.",
    "latitude": 24.4672,
    "longitude": 39.6142
  },
  {
    "name": "مسجد القبلتين - Masjid al-Qiblatayn",
    "city": "Madinah",
    "imageUrl": "https://images.unsplash.com/photo-1564769625905-50e93615e769",
    "shortHistory": "The mosque where the Qibla direction was changed from Jerusalem to Makkah.",
    "fullHistory": "مسجد القبلتين هو المسجد الذي تحولت فيه القبلة من بيت المقدس إلى الكعبة.\n\nMasjid al-Qiblatayn (The Mosque of Two Qiblas) is the historic mosque where the command to change the Qibla (prayer direction) was revealed during Zuhr prayer in the year 2 AH.\n\nThe Prophet ﷺ was leading the prayer facing Jerusalem (Bayt al-Maqdis) when Angel Jibreel came with the revelation: \"Turn your face toward al-Masjid al-Haram...\" (Al-Baqarah 2:144)\n\nThe Prophet ﷺ immediately turned toward the Kaaba in Makkah, and the congregation followed. This was the only prayer in Islamic history where two Qiblas were used.\n\nThe mosque got its name because it is the only mosque where prayers were offered toward two Qiblas.\n\nLocation: Northwestern Madinah, approximately 5 km from Masjid an-Nabawi.",
    "latitude": 24.4951,
    "longitude": 39.5819
  },
  {
    "name": "مساجد السبعة - Seven Mosques",
    "city": "Madinah",
    "imageUrl": "https://images.unsplash.com/photo-1591604129939-f1efa4d9f7fa",
    "shortHistory": "Seven small historic mosques at the site of the Battle of the Trench.",
    "fullHistory": "المساجد السبعة هي سبعة مساجد صغيرة في موقع غزوة الخندق.\n\nThe Seven Mosques (Masajid as-Sab'ah) are a group of small historic mosques located at the site of the Battle of the Trench (Al-Khandaq) which took place in 5 AH (627 CE).\n\nThe six existing mosques are named after:\n1. Masjid al-Fath (Victory)\n2. Masjid Salman al-Farsi (RA)\n3. Masjid Abu Bakr as-Siddiq (RA)\n4. Masjid Umar ibn al-Khattab (RA)\n5. Masjid Ali ibn Abi Talib (RA)\n6. Masjid Fatimah (RA)\n\nMasjid al-Fath is where the Prophet ﷺ prayed for three days during the Battle of the Trench, and it was here that Allah granted victory.\n\nLocation: Western slopes of Mount Sal', northwestern Madinah.",
    "latitude": 24.4925,
    "longitude": 39.5744
  },
  {
    "name": "منى - Mina",
    "city": "Makkah",
    "imageUrl": "https://images.unsplash.com/photo-1591604466107-ec97de577aff",
    "shortHistory": "The valley where Hajj pilgrims perform the ritual of stoning.",
    "fullHistory": "منى هو الوادي الذي يرمي فيه الحجاج الجمرات.\n\nMina is a valley located approximately 8 km southeast of Masjid al-Haram. It is an essential part of the Hajj pilgrimage where pilgrims:\n\n• Spend the nights of 8th, 11th, 12th, and 13th Dhul-Hijjah\n• Perform the ritual of Rami al-Jamarat (stoning of the pillars)\n• Make sacrifice (Qurbani) on Eid al-Adha\n\nThe stoning ritual commemorates Prophet Ibrahim's (peace be upon him) rejection of Shaytan's temptations at three locations. When Shaytan tried to dissuade Ibrahim from sacrificing his son, Ibrahim threw pebbles to drive him away.\n\nThe Prophet ﷺ said: \"Take from me your rituals [of Hajj].\" (Sahih Muslim)\n\nMina is known as the \"City of Tents\" as it houses millions of pilgrims during Hajj season.\n\nLocation: 8 km east of Makkah, valley between Makkah and Arafat.",
    "latitude": 21.4110,
    "longitude": 39.8880
  },
  {
    "name": "عرفة - Arafat",
    "city": "Makkah",
    "imageUrl": "https://images.unsplash.com/photo-1591604466107-ec97de577aff",
    "shortHistory": "The plain where pilgrims perform the most important ritual of Hajj.",
    "fullHistory": "عرفة هو الموقف الأعظم في الحج.\n\nArafat (also known as Mount Arafat or Jabal ar-Rahmah - Mountain of Mercy) is the plain where the most important ritual of Hajj takes place. Standing on Arafat on the 9th of Dhul-Hijjah is the essence of Hajj.\n\nThe Prophet ﷺ said: \"Hajj is Arafat.\" (Sunan Abu Dawud)\n\nIt was here that the Prophet ﷺ delivered his Farewell Sermon (Khutbat al-Wada) in 632 CE, where he addressed fundamental principles of Islam and human rights. On this day, the verse was revealed:\n\n\"This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion.\" (Al-Ma'idah 5:3)\n\nIt is also believed that Adam and Eve were reunited at this location after descending from Paradise, hence the name \"Arafat\" (recognition/knowing).\n\nLocation: 22 km southeast of Makkah, plain with Jabal ar-Rahmah.",
    "latitude": 21.3549,
    "longitude": 39.9844
  }
]
